app/controllers/abouts_controller.rb

SELECT `abouts`.* FROM `abouts`
SELECT `authors`.* FROM `authors`
---
  def index
    @abouts = About.all
    @authors = Author.all

SELECT `abouts`.* FROM `abouts` WHERE `abouts`.`id` = 1 LIMIT 1
---
  def show
    @about = About.find(params[:id])