app/controllers/authors_controller.rb

  def find_author
    @author ||= Author.find(params[:id])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1