app/controllers/index_controller.rb

SELECT `news`.* FROM `news`
---
  def index
    @news = News.all